hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/bootloader/dfu/nrf_dfu_req_handler.c
    NRF_LOG_DEBUG("Handle NRF_DFU_OP_OBJECT_CREATE (command)");
    
    m_observer(NRF_DFU_EVT_DFU_STARTED);
    
    nrf_dfu_result_t ret_val = nrf_dfu_validation_init_cmd_create(p_req->create.object_size);
    p_res->result = ext_err_code_handle(ret_val);
}


static void on_cmd_obj_write_request(nrf_dfu_request_t *p_req, nrf_dfu_response_t *p_res)
{
    ASSERT(p_req);
    ASSERT(p_req->write.p_data);
    ASSERT(p_req->write.len);
    ASSERT(p_res);
    
    NRF_LOG_DEBUG("Handle NRF_DFU_OP_OBJECT_WRITE (command)");
    
    nrf_dfu_result_t ret_val;
    
    ret_val = nrf_dfu_validation_init_cmd_append(p_req->write.p_data, p_req->write.len);
    p_res->result = ext_err_code_handle(ret_val);
    
    /*  Update response. This is only used when the PRN is triggered and the 'write' message
        is answered with a CRC message and these field are copied into the response. */
    cmd_response_offset_and_crc_set(p_res);
    
    /* If a callback to free the request payload buffer was provided, invoke it now. */
    if(p_req->callback.write)
        p_req->callback.write((void *)p_req->write.p_data);
}


static void on_cmd_obj_execute_request(nrf_dfu_request_t const *p_req, nrf_dfu_response_t *p_res)
{
    ASSERT(p_req);
    ASSERT(p_res);
    
    NRF_LOG_DEBUG("Handle NRF_DFU_OP_OBJECT_EXECUTE (command)");
    
    nrf_dfu_result_t ret_val;
    ret_val = nrf_dfu_validation_init_cmd_execute(&m_firmware_start_addr, &m_firmware_size_req);
    p_res->result = ext_err_code_handle(ret_val);
    
    if(p_res->result == NRF_DFU_RES_CODE_SUCCESS)
    {
        if(nrf_dfu_settings_write_and_backup(NULL) == NRF_SUCCESS)
        {
            /* Setting DFU to initialized */
            NRF_LOG_DEBUG("Writing valid init command to flash.");
        }
        
        else
            p_res->result = NRF_DFU_RES_CODE_OPERATION_FAILED;
    }
}


static void on_cmd_obj_crc_request(nrf_dfu_request_t const *p_req, nrf_dfu_response_t *p_res)
{
    UNUSED_PARAMETER(p_req);
    NRF_LOG_DEBUG("Handle NRF_DFU_OP_CRC_GET (command)");
    
    cmd_response_offset_and_crc_set(p_res);
}


/** @brief Function handling command requests from the transport layer.

    @param   p_req[in]       Pointer to the structure holding the DFU request.
    @param   p_res[out]      Pointer to the structure holding the DFU response.

    @retval NRF_SUCCESS      If the command request was executed successfully.
                            Any other error code indicates that the data request
                            could not be handled.
*/
static void nrf_dfu_command_req(nrf_dfu_request_t *p_req, nrf_dfu_response_t *p_res)
{
    ASSERT(p_req);
    ASSERT(p_res);
    
    switch(p_req->request)
    {
        case NRF_DFU_OP_OBJECT_CREATE:
        {
            on_cmd_obj_create_request(p_req, p_res);
        }
        break;
        
        case NRF_DFU_OP_CRC_GET:
        {
            on_cmd_obj_crc_request(p_req, p_res);
        }
        break;
        
        case NRF_DFU_OP_OBJECT_WRITE:
        {
            on_cmd_obj_write_request(p_req, p_res);
        }
        break;
        
        case NRF_DFU_OP_OBJECT_EXECUTE:
        {
            on_cmd_obj_execute_request(p_req, p_res);
        }
        break;
        
        case NRF_DFU_OP_OBJECT_SELECT:
        {
            on_cmd_obj_select_request(p_req, p_res);
        }
        break;
        
        default:
        {
            ASSERT(false);
        }
        break;
    }
}


static void on_data_obj_select_request(nrf_dfu_request_t *p_req, nrf_dfu_response_t *p_res)
{
    NRF_LOG_DEBUG("Handle NRF_DFU_OP_OBJECT_SELECT (data)");
    
    p_res->select.crc    = s_dfu_settings.progress.firmware_image_crc;
    p_res->select.offset = s_dfu_settings.progress.firmware_image_offset;
    
    p_res->select.max_size = DATA_OBJECT_MAX_SIZE;
    
    NRF_LOG_DEBUG("crc = 0x%x, offset = 0x%x, max_size = 0x%x",
                  p_res->select.crc,
                  p_res->select.offset,
                  p_res->select.max_size);
}


static void on_data_obj_create_request(nrf_dfu_request_t *p_req, nrf_dfu_response_t *p_res)
{
    NRF_LOG_DEBUG("Handle NRF_DFU_OP_OBJECT_CREATE (data)");
    
    if(!nrf_dfu_validation_init_cmd_present())
    {
        /* Can't accept data because DFU isn't initialized by init command. */
        NRF_LOG_ERROR("Cannot create data object without valid init command");
        p_res->result = NRF_DFU_RES_CODE_OPERATION_NOT_PERMITTED;
        return;
    }
    
    if(p_req->create.object_size == 0)
    {
        NRF_LOG_ERROR("Object size cannot be 0.")
        p_res->result = NRF_DFU_RES_CODE_INVALID_PARAMETER;
        return;
    }
    
    if(((p_req->create.object_size & (CODE_PAGE_SIZE - 1)) != 0)
       && (s_dfu_settings.progress.firmware_image_offset_last + p_req->create.object_size != m_firmware_size_req))
    {
        NRF_LOG_ERROR("Object size must be page aligned");
        p_res->result = NRF_DFU_RES_CODE_INVALID_PARAMETER;
        return;
    }
    
    if(p_req->create.object_size > DATA_OBJECT_MAX_SIZE)
    {
        /* It is impossible to handle the command because the size is too large */
        NRF_LOG_ERROR("Invalid size for object (too large)");
        p_res->result = NRF_DFU_RES_CODE_INSUFFICIENT_RESOURCES;
        return;
    }
    
    if((s_dfu_settings.progress.firmware_image_offset_last + p_req->create.object_size) >
       m_firmware_size_req)
    {
        NRF_LOG_ERROR("Creating the object with size 0x%08x would overflow firmware size. "
                      "Offset is 0x%08x and firmware size is 0x%08x.",
                      p_req->create.object_size,
                      s_dfu_settings.progress.firmware_image_offset_last,
                      m_firmware_size_req);
                      
        p_res->result = NRF_DFU_RES_CODE_OPERATION_NOT_PERMITTED;
        return;
    }
    
    s_dfu_settings.progress.data_object_size      = p_req->create.object_size;
    s_dfu_settings.progress.firmware_image_crc    = s_dfu_settings.progress.firmware_image_crc_last;
    s_dfu_settings.progress.firmware_image_offset = s_dfu_settings.progress.firmware_image_offset_last;
    s_dfu_settings.write_offset                   = s_dfu_settings.progress.firmware_image_offset_last;
    
    /* Erase the page we're at. */
    if(nrf_dfu_flash_erase((m_firmware_start_addr + s_dfu_settings.progress.firmware_image_offset),
                           CEIL_DIV(p_req->create.object_size, CODE_PAGE_SIZE), NULL) != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Erase operation failed");
        p_res->result = NRF_DFU_RES_CODE_INVALID_OBJECT;
        return;
    }
    
    NRF_LOG_DEBUG("Creating object with size: %d. Offset: 0x%08x, CRC: 0x%08x",
                  s_dfu_settings.progress.data_object_size,
                  s_dfu_settings.progress.firmware_image_offset,
                  s_dfu_settings.progress.firmware_image_crc);
}


static void on_data_obj_write_request(nrf_dfu_request_t *p_req, nrf_dfu_response_t *p_res)
{
    NRF_LOG_DEBUG("Handle NRF_DFU_OP_OBJECT_WRITE (data)");
    
