hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/bootloader/dfu/nrf_dfu_req_handler.c
    if(!nrf_dfu_validation_init_cmd_present())
    {
        /* Can't accept data because DFU isn't initialized by init command. */
        p_res->result = NRF_DFU_RES_CODE_OPERATION_NOT_PERMITTED;
        return;
    }
    
    uint32_t const data_object_offset = s_dfu_settings.progress.firmware_image_offset -
                                        s_dfu_settings.progress.firmware_image_offset_last;
                                        
    if((p_req->write.len + data_object_offset) > s_dfu_settings.progress.data_object_size)
    {
        /* Can't accept data because too much data has been received. */
        NRF_LOG_ERROR("Write request too long");
        p_res->result = NRF_DFU_RES_CODE_INVALID_PARAMETER;
        return;
    }
    
    uint32_t const write_addr = m_firmware_start_addr + s_dfu_settings.write_offset;
    
    ASSERT(p_req->callback.write);
    
    ret_code_t ret =
        nrf_dfu_flash_store(write_addr, p_req->write.p_data, p_req->write.len, p_req->callback.write);
        
    if(ret != NRF_SUCCESS)
    {
        /*  When nrf_dfu_flash_store() fails because there is no space in the queue,
            stop processing the request so that the peer can detect a CRC error
            and retransmit this object. Remember to manually free the buffer !
        */
        p_req->callback.write((void *)p_req->write.p_data);
        return;
    }
    
    /* Update the CRC of the firmware image. */
    s_dfu_settings.write_offset                   += p_req->write.len;
    s_dfu_settings.progress.firmware_image_offset += p_req->write.len;
    s_dfu_settings.progress.firmware_image_crc     =
        crc32_compute(p_req->write.p_data, p_req->write.len, &s_dfu_settings.progress.firmware_image_crc);
        
    /*  This is only used when the PRN is triggered and the 'write' message
        is answered with a CRC message and these field are copied into the response.
    */
    p_res->write.crc    = s_dfu_settings.progress.firmware_image_crc;
    p_res->write.offset = s_dfu_settings.progress.firmware_image_offset;
}


static void on_data_obj_crc_request(nrf_dfu_request_t *p_req, nrf_dfu_response_t *p_res)
{
    NRF_LOG_DEBUG("Handle NRF_DFU_OP_CRC_GET (data)");
    NRF_LOG_DEBUG("Offset:%d, CRC:0x%08x",
                  s_dfu_settings.progress.firmware_image_offset,
                  s_dfu_settings.progress.firmware_image_crc);
                  
    p_res->crc.crc    = s_dfu_settings.progress.firmware_image_crc;
    p_res->crc.offset = s_dfu_settings.progress.firmware_image_offset;
}


static void on_data_obj_execute_request_sched(void *p_evt, uint16_t event_length)
{
    UNUSED_PARAMETER(event_length);
    
    ret_code_t          ret;
    nrf_dfu_request_t *p_req = (nrf_dfu_request_t *)(p_evt);
    
    /* Wait for all buffers to be written in flash. */
    if(nrf_fstorage_is_busy(NULL))
    {
        ret = app_sched_event_put(p_req, sizeof(nrf_dfu_request_t), on_data_obj_execute_request_sched);
        
        if(ret != NRF_SUCCESS)
            NRF_LOG_ERROR("Failed to schedule object execute: 0x%x.", ret);
            
        return;
    }
    
    nrf_dfu_response_t res =
    {
        .request = NRF_DFU_OP_OBJECT_EXECUTE,
    };
    
    if(s_dfu_settings.progress.firmware_image_offset == m_firmware_size_req)
    {
        NRF_LOG_DEBUG("Whole firmware image received. Postvalidating.");
        
        res.result = nrf_dfu_validation_post_data_execute(m_firmware_start_addr, m_firmware_size_req);
        res.result = ext_err_code_handle(res.result);
        
        /* Provide response to transport */
        p_req->callback.response(&res, p_req->p_context);
        
        ret = nrf_dfu_settings_write_and_backup((nrf_dfu_flash_callback_t)on_dfu_complete);
        UNUSED_RETURN_VALUE(ret);
    }
    
    else
    {
        res.result = NRF_DFU_RES_CODE_SUCCESS;
        
        /* Provide response to transport */
        p_req->callback.response(&res, p_req->p_context);
        
        if(NRF_DFU_SAVE_PROGRESS_IN_FLASH)
        {
            /* Allowing skipping settings backup to save time and flash wear. */
            ret = nrf_dfu_settings_write_and_backup(NULL);
            UNUSED_RETURN_VALUE(ret);
        }
    }
    
    NRF_LOG_DEBUG("Request handling complete. Result: 0x%x", res.result);
}


static bool on_data_obj_execute_request(nrf_dfu_request_t *p_req, nrf_dfu_response_t *p_res)
{
    NRF_LOG_DEBUG("Handle NRF_DFU_OP_OBJECT_EXECUTE (data)");
    
    uint32_t const data_object_size = s_dfu_settings.progress.firmware_image_offset -
                                      s_dfu_settings.progress.firmware_image_offset_last;
                                      
    if(s_dfu_settings.progress.data_object_size != data_object_size)
    {
        /* The size of the written object was not as expected. */
        NRF_LOG_ERROR("Invalid data. expected: %d, got: %d",
                      s_dfu_settings.progress.data_object_size,
                      data_object_size);
                      
        p_res->result = NRF_DFU_RES_CODE_OPERATION_NOT_PERMITTED;
        return true;
    }
    
    /* Update the offset and crc values for the last object written. */
    s_dfu_settings.progress.data_object_size           = 0;
    s_dfu_settings.progress.firmware_image_crc_last    = s_dfu_settings.progress.firmware_image_crc;
    s_dfu_settings.progress.firmware_image_offset_last = s_dfu_settings.progress.firmware_image_offset;
    
    on_data_obj_execute_request_sched(p_req, 0);
    
    m_observer(NRF_DFU_EVT_OBJECT_RECEIVED);
    
    return false;
}


static bool nrf_dfu_data_req(nrf_dfu_request_t *p_req, nrf_dfu_response_t *p_res)
{
    ASSERT(p_req);
    ASSERT(p_res);
    
    bool response_ready = true;
    
    switch(p_req->request)
    {
        case NRF_DFU_OP_OBJECT_CREATE:
        {
            on_data_obj_create_request(p_req, p_res);
        }
        break;
        
        case NRF_DFU_OP_OBJECT_WRITE:
        {
            on_data_obj_write_request(p_req, p_res);
        }
        break;
        
        case NRF_DFU_OP_CRC_GET:
        {
            on_data_obj_crc_request(p_req, p_res);
        }
        break;
        
        case NRF_DFU_OP_OBJECT_EXECUTE:
        {
            response_ready = on_data_obj_execute_request(p_req, p_res);
        }
        break;
        
