hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/bootloader/dfu/nrf_dfu_req_handler.c
        case NRF_DFU_OP_OBJECT_SELECT:
        {
            on_data_obj_select_request(p_req, p_res);
        }
        break;
        
        default:
        {
            ASSERT(false);
        }
        break;
    }
    
    return response_ready;
}


/** @brief Function for handling requests to manipulate data or command objects.

    @param[in]  p_req    Request.
    @param[out] p_res    Response.

    @return  Whether response is ready to be sent.
*/
static bool nrf_dfu_obj_op(nrf_dfu_request_t *p_req, nrf_dfu_response_t *p_res)
{
    /* Keep track of the current object type since write and execute requests don't contain it. */
    static nrf_dfu_obj_type_t current_object = NRF_DFU_OBJ_TYPE_COMMAND;
    
    if((p_req->request == NRF_DFU_OP_OBJECT_SELECT)
       || (p_req->request == NRF_DFU_OP_OBJECT_CREATE))
    {
        STATIC_ASSERT(offsetof(nrf_dfu_request_select_t, object_type) ==
                      offsetof(nrf_dfu_request_create_t, object_type),
                      "Wrong object_type offset!");
                      
        current_object = (nrf_dfu_obj_type_t)(p_req->select.object_type);
    }
    
    bool response_ready = true;
    
    switch(current_object)
    {
        case NRF_DFU_OBJ_TYPE_COMMAND:
            nrf_dfu_command_req(p_req, p_res);
            break;
            
        case NRF_DFU_OBJ_TYPE_DATA:
            response_ready = nrf_dfu_data_req(p_req, p_res);
            break;
            
        default:
            /* The select request had an invalid object type. */
            NRF_LOG_ERROR("Invalid object type in request.");
            current_object = NRF_DFU_OBJ_TYPE_INVALID;
            p_res->result  = NRF_DFU_RES_CODE_INVALID_OBJECT;
            break;
    }
    
    return response_ready;
}


static void nrf_dfu_req_handler_req_process(nrf_dfu_request_t *p_req)
{
    ASSERT(p_req->callback.response);
    
    bool response_ready = true;
    
    /* The request handlers assume these values to be set. */
    nrf_dfu_response_t response =
    {
        .request = p_req->request,
        .result  = NRF_DFU_RES_CODE_SUCCESS,
    };
    
    
    switch(p_req->request)
    {
        case NRF_DFU_OP_PROTOCOL_VERSION:
        {
            on_protocol_version_request(p_req, &response);
        }
        break;
        
        case NRF_DFU_OP_HARDWARE_VERSION:
        {
            on_hw_version_request(p_req, &response);
        }
        break;
        
        case NRF_DFU_OP_FIRMWARE_VERSION:
        {
            on_fw_version_request(p_req, &response);
        }
        break;
        
        case NRF_DFU_OP_PING:
        {
            on_ping_request(p_req, &response);
        }
        break;
        
        case NRF_DFU_OP_RECEIPT_NOTIF_SET:
        {
            on_prn_set_request(p_req, &response);
        }
        break;
        
        case NRF_DFU_OP_MTU_GET:
        {
            on_mtu_get_request(p_req, &response);
        }
        break;
        
        case NRF_DFU_OP_ABORT:
        {
            on_abort_request(p_req, &response);
        }
        break;
        
        case NRF_DFU_OP_OBJECT_CREATE:
        
        /* Restart the inactivity timer on CREATE messages. */
        /* Fallthrough. */
        case NRF_DFU_OP_OBJECT_SELECT:
        case NRF_DFU_OP_OBJECT_WRITE:
        case NRF_DFU_OP_OBJECT_EXECUTE:
        case NRF_DFU_OP_CRC_GET:
        {
            response_ready = nrf_dfu_obj_op(p_req, &response);
        }
        break;
        
        default:
            NRF_LOG_INFO("Invalid opcode received: 0x%x.", p_req->request);
            response.result = NRF_DFU_RES_CODE_OP_CODE_NOT_SUPPORTED;
            break;
    }
    
    if(response_ready)
    {
        NRF_LOG_DEBUG("Request handling complete. Result: 0x%x", response.result);
        
        p_req->callback.response(&response, p_req->p_context);
        
        if(response.result != NRF_DFU_RES_CODE_SUCCESS)
            m_observer(NRF_DFU_EVT_DFU_FAILED);
    }
}


static void nrf_dfu_req_handler_req(void *p_evt, uint16_t event_length)
{
    nrf_dfu_request_t *p_req = (nrf_dfu_request_t *)(p_evt);
    nrf_dfu_req_handler_req_process(p_req);
}


ret_code_t nrf_dfu_req_handler_on_req(nrf_dfu_request_t *p_req)
{
    ret_code_t ret;
    
    if(p_req->callback.response == NULL)
        return NRF_ERROR_INVALID_PARAM;
        
    ret = app_sched_event_put(p_req, sizeof(nrf_dfu_request_t), nrf_dfu_req_handler_req);
    
    if(ret != NRF_SUCCESS)
        NRF_LOG_WARNING("Scheduler ran out of space!");
        
    return ret;
}


ret_code_t nrf_dfu_req_handler_init(nrf_dfu_observer_t observer)
{
    ret_code_t       ret_val;
    nrf_dfu_result_t result;
    
    if(observer == NULL)
        return NRF_ERROR_INVALID_PARAM;
        
    #ifdef BLE_STACK_SUPPORT_REQD
    ret_val  = nrf_dfu_flash_init(true);
    #else
    ret_val = nrf_dfu_flash_init(false);
    #endif
    
    if(ret_val != NRF_SUCCESS)
        return ret_val;
        
    nrf_dfu_validation_init();
    
    if(nrf_dfu_validation_init_cmd_present())
    {
        /* Execute a previously received init packed. Subsequent executes will have no effect. */
        result = nrf_dfu_validation_init_cmd_execute(&m_firmware_start_addr, &m_firmware_size_req);
        
        if(result != NRF_DFU_RES_CODE_SUCCESS)
        {
            /* Init packet in flash is not valid! */
            return NRF_ERROR_INTERNAL;
        }
    }
    
    m_observer = observer;
    
    /* Initialize extended error handling with "No error" as the most recent error. */
    result = ext_error_set(NRF_DFU_EXT_ERROR_NO_ERROR);
    UNUSED_RETURN_VALUE(result);
    
    return NRF_SUCCESS;
}
